Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.GetMessageExecutionStatus Method
Note: This API is now obsolete.
 Gets the current message execution mode for the application.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("GetMessageExecutionStatus is obsolete and defaults always to BY_COMMIT.",
	false)]
public static DrawingHandler.MessageExecutionModeEnum GetMessageExecutionStatus()
<ObsoleteAttribute("GetMessageExecutionStatus is obsolete and defaults always to BY_COMMIT.",
	false)>
Public Shared Function GetMessageExecutionStatus As DrawingHandler.MessageExecutionModeEnum
Return Value
Type: DrawingHandler.MessageExecutionModeEnum
The current message execution mode.
See Also
Reference
DrawingHandler Class
Tekla.Structures.Drawing Namespace